[
{
    "model": "courses.categorymodel",
    "pk": 1,
    "fields": {
        "category": "Code"
    }
},
{
    "model": "courses.categorymodel",
    "pk": 2,
    "fields": {
        "category": "General"
    }
},
{
    "model": "courses.categorymodel",
    "pk": 3,
    "fields": {
        "category": "Game"
    }
},
{
    "model": "courses.coursesmodel",
    "pk": 1,
    "fields": {
        "owner": 2,
        "title": "The Django book",
        "description": "You’re reading The Django Book, first published in December 2007 (and updated in 2009) by Apress as The Definitive Guide to Django: Web Development Done Right.\r\n\r\nWe’ve released this book freely for a couple of reasons. First, we love Django and we want it to be as accessible as possible. Many programmers learn their craft from well-written technical material, so we set out to create a top-notch guide and reference to Django.\r\n\r\nSecond, it turns out that writing books about technology is fundamentally difficult: your words are often outdated before the book even reaches the printer. On the web, however, “the ink is never dry” — we can (and will!) keep the book updated.",
        "level": "Any",
        "category": 2,
        "preview_image": "blanks/django.jpg",
        "preview_video": "",
        "created_at": "2024-05-19T11:07:11.728Z",
        "updated_at": "2024-05-23T16:55:20.619Z"
    }
},
{
    "model": "courses.coursesmodel",
    "pk": 2,
    "fields": {
        "owner": 2,
        "title": "Narmaya guide",
        "description": "The \"Narmaya Guide\" is a comprehensive resource for mastering Narmaya, a beloved character in Granblue Fantasy. Designed for both new and experienced players, this guide covers all aspects of optimizing Narmaya's potential in various game modes. It includes detailed breakdowns of her abilities, recommended weapon grids, and team compositions that highlight her strengths. The guide also offers strategic insights on maximizing her performance in raids, events, and solo content. With practical tips, illustrative examples, and updates reflecting the latest game patches, the \"Narmaya Guide\" equips players with the knowledge needed to fully unleash Narmaya's power. This guide is community-driven and constantly evolving to provide the most accurate and effective strategies.",
        "level": "Intermediate",
        "category": 3,
        "preview_image": "preview/images/narmaya_fKHI3yD.png",
        "preview_video": "",
        "created_at": "2024-05-19T11:11:16.325Z",
        "updated_at": "2024-05-24T15:55:36.263Z"
    }
},
{
    "model": "courses.coursesmodel",
    "pk": 3,
    "fields": {
        "owner": 2,
        "title": "How to create django app",
        "description": "Django is a high-level Python web framework that encourages rapid development and clean, pragmatic design. Built by experienced developers, it takes care of much of the hassle of web development, so you can focus on writing your app without needing to reinvent the wheel. It’s free and open source.",
        "level": "Intermediate",
        "category": 1,
        "preview_image": "blanks/python.png",
        "preview_video": "",
        "created_at": "2024-05-19T12:18:22.359Z",
        "updated_at": "2024-05-23T08:34:49.566Z"
    }
},
{
    "model": "courses.coursesmodel",
    "pk": 4,
    "fields": {
        "owner": 2,
        "title": "Introduction to Js",
        "description": "JavaScript is a versatile, high-level programming language that enables dynamic and interactive web development. Widely used by developers, it seamlessly integrates with HTML and CSS to create rich, engaging user interfaces. JavaScript supports both client-side and server-side development, allowing you to build full-stack applications with ease. Its vast ecosystem of libraries and frameworks, such as React, Angular, and Node.js, helps streamline the development process. JavaScript is free to use, open source, and continues to evolve with contributions from a vibrant global community.",
        "level": "Beginner",
        "category": 1,
        "preview_image": "blanks/js.png",
        "preview_video": "",
        "created_at": "2024-05-19T12:21:08.383Z",
        "updated_at": "2024-05-22T14:21:37.451Z"
    }
},
{
    "model": "courses.coursesmodel",
    "pk": 5,
    "fields": {
        "owner": 3,
        "title": "GameDev for beginners",
        "description": "GameDev for Beginners is an accessible and comprehensive guide to game development, designed to introduce aspiring developers to the fundamentals of creating video games. Whether you're new to coding or have some programming experience, this resource breaks down complex concepts into manageable steps, covering everything from basic game mechanics to more advanced topics like physics and AI. With practical examples and hands-on projects, GameDev for Beginners helps you build your first game from scratch while fostering creativity and problem-solving skills. It’s free and open source, supported by a community of passionate game developers eager to help you succeed.",
        "level": "Beginner",
        "category": 3,
        "preview_image": "preview/images/barbara.jpg",
        "preview_video": "",
        "created_at": "2024-05-19T12:21:58.166Z",
        "updated_at": "2024-05-23T16:56:20.722Z"
    }
},
{
    "model": "courses.coursesmodel",
    "pk": 6,
    "fields": {
        "owner": 2,
        "title": "About VueJs",
        "description": "Vue.js is a progressive JavaScript framework for building user interfaces. Designed to be incrementally adoptable, it can function as a simple library to enhance a webpage or as a full-fledged framework to power complex single-page applications. Vue.js focuses on an approachable and versatile architecture, making it easy to integrate with other projects and libraries. It provides reactive data binding and a component-based model, enabling developers to create reusable, maintainable, and efficient code. With a strong community, extensive documentation, and a growing ecosystem of tools and plugins, Vue.js is a powerful and flexible solution for modern web development. It's free and open source.",
        "level": "Any",
        "category": 1,
        "preview_image": "blanks/vue-js.png",
        "preview_video": "",
        "created_at": "2024-05-20T16:34:50.068Z",
        "updated_at": "2024-05-22T14:57:37.809Z"
    }
},
{
    "model": "courses.coursesmodel",
    "pk": 7,
    "fields": {
        "owner": 2,
        "title": "How to make React app",
        "description": "React is a powerful JavaScript library for building user interfaces, primarily used for creating dynamic and responsive single-page applications. Developed and maintained by Facebook, it emphasizes a component-based architecture, allowing developers to build encapsulated components that manage their own state. This modular approach facilitates the creation of complex UIs by combining simple, reusable components. React’s virtual DOM ensures high performance by efficiently updating and rendering only the components that change. Its extensive ecosystem, including tools like React Router and Redux, and its strong community support make React a versatile and reliable choice for modern web development. React is free and open source.",
        "level": "Intermediate",
        "category": 1,
        "preview_image": "blanks/react.png",
        "preview_video": "",
        "created_at": "2024-05-20T16:40:58.614Z",
        "updated_at": "2024-05-22T13:53:51.466Z"
    }
},
{
    "model": "courses.coursesmodel",
    "pk": 9,
    "fields": {
        "owner": 3,
        "title": "You don't know about js",
        "description": "It seems like there's never been as much widespread desire before for a better way to deeply learn the fundamentals of JavaScript. But with a million blogs, books, and videos out there, just where do you START? Look no further!The worldwide best selling \"You Don't Know JS\" book series is back for a 2nd edition: \"You Don't Know JS Yet\". All 6 books are brand new, rewritten to cover all sides of JS for 2020 and beyond.\"Get Started\" prepares you for the journey ahead, first surveying the language then detailing how the rest of the You Don't Know JS Yet book series guides you to knowing JS more deeply.",
        "level": "Any",
        "category": 2,
        "preview_image": "preview/images/macos-mojave-night-wallpaper-33048d6dbcf8413fb105175654ac0812_AWSszpY.jpg",
        "preview_video": "",
        "created_at": "2024-05-22T17:10:23.055Z",
        "updated_at": "2024-05-23T10:15:15.198Z"
    }
},
{
    "model": "courses.coursesmodel",
    "pk": 10,
    "fields": {
        "owner": 3,
        "title": "Bridget guide",
        "description": "Some people might call a yo-yo a poor choice of weapon, but they just don't have enough creativity! With speed, range, and dizzying mix-ups, this girl can run circles around any opponent!\r\n\r\nBridget is a well-rounded character who is easy to pick up and play, with high range, good mobility, a meterless reversal, and simple combos that lead into strong pressure situations. However, don't be fooled into thinking that means she's simple! Her Stop and Dash setplay projectile and Rolling Movement can be layered together and combined with her other tools in countless ways, giving her a uniquely expressive flair in her offence!\r\n\r\nTo complement this, Bridget has a fantastic suite of neutral tools. f.S and 5H reach very far, and possess both slightly disjointed hitboxes as well as follow-ups with fantastic corner carry that allow Bridget to start her offence on hit. Paired with her multi-hitting 2S to catch movement and help shore up the weakness to 6Ps and similar low profile options, she has the ability to assert dominant control over the ground. Her air control is similarly extremely strong, with j.H being one of the rare air normals to possess a significant disjoint, as well as her wide and high striking 2H.",
        "level": "Beginner",
        "category": 3,
        "preview_image": "preview/images/c50382006ca10f2ac2a1b1fbb4ac1c98.jpg",
        "preview_video": "",
        "created_at": "2024-05-23T12:42:05.513Z",
        "updated_at": "2024-05-23T13:21:04.885Z"
    }
},
{
    "model": "courses.coursesmodel",
    "pk": 11,
    "fields": {
        "owner": 2,
        "title": "How to create horizontal scroll bar",
        "description": "div.scrollmenu {\r\n  background-color: #333;\r\n  overflow: auto;\r\n  white-space: nowrap;\r\n}\r\n\r\ndiv.scrollmenu a {\r\n  display: inline-block;\r\n  color: white;\r\n  text-align: center;\r\n  padding: 14px;\r\n  text-decoration: none;\r\n}\r\n\r\ndiv.scrollmenu a:hover {\r\n  background-color: #777;\r\n}",
        "level": "Beginner",
        "category": 1,
        "preview_image": "preview/images/background.png",
        "preview_video": "",
        "created_at": "2024-05-23T17:01:13.022Z",
        "updated_at": "2024-05-23T17:01:13.022Z"
    }
},
{
    "model": "courses.coursesmodel",
    "pk": 12,
    "fields": {
        "owner": 2,
        "title": "Java is ease",
        "description": "Java is a versatile, high-level programming language renowned for its portability, performance, and security. Originally developed by Sun Microsystems, now owned by Oracle, Java is designed to be platform-independent, allowing applications to run on any device with the Java Virtual Machine (JVM). It follows an object-oriented programming model, promoting modular, reusable code. Java is widely used in various domains, from web and mobile applications to enterprise solutions and large-scale systems. Its extensive standard library and robust ecosystem of frameworks and tools, such as Spring and Hibernate, streamline development and enhance productivity. Java is free to use and open source, with a strong community and continuous updates ensuring its relevance in modern software development.",
        "level": "Beginner",
        "category": 1,
        "preview_image": "blanks/java.png",
        "preview_video": "",
        "created_at": "2024-05-23T17:01:13.022Z",
        "updated_at": "2024-05-23T17:01:13.022Z"
    }
},
{
    "model": "courses.courseitemmodel",
    "pk": 1,
    "fields": {
        "course": 4,
        "name": "Some",
        "course_file": "course/Screencast_from_2024-05-19_20-00-24.webm",
        "description": null
    }
},
{
    "model": "courses.courseitemmodel",
    "pk": 2,
    "fields": {
        "course": 4,
        "name": "lesson 5 - Array",
        "course_file": "course/1311796.png",
        "description": ""
    }
}
]
